js216/stm32mp135_test_board/cubemx/sr835-mb.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_1
ADC1.CommonPathInternal=null|null|null|null
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC1.master=1
Application.IPs=RCC,SYS\:I,DMA,MDMA,NVIC2\:I,TIM2,LTDC,FMC,TIM1,I2C5,ETH1,ADC1,QUADSPI,UART4,UART8,SPI1,I2S1,SDMMC1,USART1,UART7,USART3,USART6,UART5,USART2,SPI2,I2S2,I2C1,I2C2,SPI4,I2S4,SPI5,I2C3,I2C4,USBH_HS2
CAD.formats=[]
CAD.pinconfig=Dual
CAD.provider=
DDR.DDR_Frequency=408.0
DDR.DFITMG0=0x02060105
DDR.DRAMTMG0=0x11151B10
DDR.DRAMTMG1=0x000A0417
DDR.DRAMTMG4=0x07040507
DDR.DRAMTMG5=0x05050403
DDR.DTPR0=0x2EB077D0
DDR.DTPR1=0x096B00A8
DDR.DTPR2=0x10022A00
DDR.IPParameters=DDR_Frequency,RL,addrmap_col_b10,addrmap_col_b11,addrmap_bank_b0,addrmap_bank_b1,addrmap_bank_b2,addrmap_row_b0,addrmap_row_b1,addrmap_row_b2_10,addrmap_row_b11,addrmap_row_b12,addrmap_row_b13,addrmap_row_b14,addrmap_row_b15,RFSHTMG,DRAMTMG0,DRAMTMG1,DRAMTMG5,SCHED,PTR0,PTR1,PTR2,DTPR0,DTPR1,DTPR2,MR0,TEMPERATURE_OVER_85C,tREFI,wr2pre,t_faw,t_ras_max,t_ras_min,t_xp,t_rd2pre,t_rp,t_rc,read_latency,rd2wr,wr2rd,t_mod,t_rcd,t_rrd,t_cksrx,t_cksre,t_ckesr,t_cke,t_xs_dll_x32,t_xs_x32,t_rfc_nom_x1_x32,t_rfc_min,tdlllock,tdllsrst,tdinit1,tdinit0,tdinit2,tccd,trc,trrd,tras,trcd,trp,twtr,trtp,tmrd,trfc,tmod,tfaw,tdllk,tcke,txp,txs,MR0.WR,MR0.CL,MR2.RTT,MR2.CWL,DFITMG0,tRCD,RELAXED_TIMING_MODE,DRAMTMG4
DDR.MR0=0x00000640
DDR.MR0.CL=4
DDR.MR0.WR=3
DDR.MR2.CWL=1
DDR.MR2.RTT=1
DDR.PTR0=0x00220A55
DDR.PTR1=0x037B1CE0
DDR.PTR2=0x042D3EC0
DDR.RELAXED_TIMING_MODE=false
DDR.RFSHTMG=0x0063006B
DDR.RL=8
DDR.SCHED=0x00000F01
DDR.TEMPERATURE_OVER_85C=false
DDR.addrmap_bank_b0=8
DDR.addrmap_bank_b1=8
DDR.addrmap_bank_b2=8
DDR.addrmap_col_b10=31
DDR.addrmap_col_b11=31
DDR.addrmap_row_b0=7
DDR.addrmap_row_b1=7
DDR.addrmap_row_b11=7
DDR.addrmap_row_b12=7
DDR.addrmap_row_b13=7
DDR.addrmap_row_b14=7
DDR.addrmap_row_b15=15
DDR.addrmap_row_b2_10=7
DDR.rd2wr=9
DDR.read_latency=8
DDR.tRCD=15.0
DDR.tREFI=7.8
DDR.t_cke=3
DDR.t_ckesr=4
DDR.t_cksre=5
DDR.t_cksrx=5
DDR.t_faw=21
DDR.t_mod=12
DDR.t_ras_max=27
DDR.t_ras_min=16
DDR.t_rc=23
DDR.t_rcd=7
DDR.t_rd2pre=4
DDR.t_rfc_min=107
DDR.t_rfc_nom_x1_x32=99
DDR.t_rp=7
DDR.t_rrd=5
DDR.t_xp=10
DDR.t_xs_dll_x32=16
DDR.t_xs_x32=5
DDR.tccd=0
DDR.tcke=4
DDR.tdinit0=204000
DDR.tdinit1=111
DDR.tdinit2=81600
DDR.tdllk=512
DDR.tdlllock=2089
DDR.tdllsrst=21
DDR.tfaw=21
DDR.tmod=0
DDR.tmrd=0
DDR.tras=16
DDR.trc=23
DDR.trcd=7
DDR.trfc=107
DDR.trp=7
DDR.trrd=5
DDR.trtp=4
DDR.twtr=6
DDR.txp=10
DDR.txs=512
DDR.wr2pre=17
DDR.wr2rd=15
DDR_A0.GPIOParameters=PinAttribute
DDR_A0.Mode=DDR3
DDR_A0.PinAttribute=FirstStageBootLoader
DDR_A0.Signal=DDR_A0
DDR_A1.GPIOParameters=PinAttribute
DDR_A1.Mode=DDR3
DDR_A1.PinAttribute=FirstStageBootLoader
DDR_A1.Signal=DDR_A1
DDR_A10.GPIOParameters=PinAttribute
DDR_A10.Mode=DDR3
DDR_A10.PinAttribute=FirstStageBootLoader
DDR_A10.Signal=DDR_A10
DDR_A11.GPIOParameters=PinAttribute
DDR_A11.Mode=DDR3
DDR_A11.PinAttribute=FirstStageBootLoader
DDR_A11.Signal=DDR_A11
DDR_A12.GPIOParameters=PinAttribute
DDR_A12.Mode=4Gb_16bits
DDR_A12.PinAttribute=FirstStageBootLoader
DDR_A12.Signal=DDR_A12
DDR_A13.GPIOParameters=PinAttribute
DDR_A13.Mode=4Gb_16bits
DDR_A13.PinAttribute=FirstStageBootLoader
DDR_A13.Signal=DDR_A13
DDR_A14.GPIOParameters=PinAttribute
DDR_A14.Mode=4Gb_16bits
DDR_A14.PinAttribute=FirstStageBootLoader
DDR_A14.Signal=DDR_A14
DDR_A2.GPIOParameters=PinAttribute
DDR_A2.Mode=DDR3
DDR_A2.PinAttribute=FirstStageBootLoader
DDR_A2.Signal=DDR_A2
DDR_A3.GPIOParameters=PinAttribute
DDR_A3.Mode=DDR3
DDR_A3.PinAttribute=FirstStageBootLoader
DDR_A3.Signal=DDR_A3
DDR_A4.GPIOParameters=PinAttribute
DDR_A4.Mode=DDR3
DDR_A4.PinAttribute=FirstStageBootLoader
DDR_A4.Signal=DDR_A4
DDR_A5.GPIOParameters=PinAttribute
DDR_A5.Mode=DDR3
DDR_A5.PinAttribute=FirstStageBootLoader
DDR_A5.Signal=DDR_A5
DDR_A6.GPIOParameters=PinAttribute
DDR_A6.Mode=DDR3
DDR_A6.PinAttribute=FirstStageBootLoader
DDR_A6.Signal=DDR_A6
DDR_A7.GPIOParameters=PinAttribute
DDR_A7.Mode=DDR3
DDR_A7.PinAttribute=FirstStageBootLoader
DDR_A7.Signal=DDR_A7
DDR_A8.GPIOParameters=PinAttribute
DDR_A8.Mode=DDR3
DDR_A8.PinAttribute=FirstStageBootLoader
DDR_A8.Signal=DDR_A8
DDR_A9.GPIOParameters=PinAttribute
DDR_A9.Mode=DDR3
DDR_A9.PinAttribute=FirstStageBootLoader
DDR_A9.Signal=DDR_A9
DDR_ATO.GPIOParameters=PinAttribute
DDR_ATO.Mode=DDR3
DDR_ATO.PinAttribute=FirstStageBootLoader
DDR_ATO.Signal=DDR_ATO
DDR_BA0.GPIOParameters=PinAttribute
DDR_BA0.Mode=DDR3
DDR_BA0.PinAttribute=FirstStageBootLoader
DDR_BA0.Signal=DDR_BA0
DDR_BA1.GPIOParameters=PinAttribute
DDR_BA1.Mode=DDR3
DDR_BA1.PinAttribute=FirstStageBootLoader
DDR_BA1.Signal=DDR_BA1
DDR_BA2.GPIOParameters=PinAttribute
DDR_BA2.Mode=DDR3
DDR_BA2.PinAttribute=FirstStageBootLoader
DDR_BA2.Signal=DDR_BA2
DDR_CASN.GPIOParameters=PinAttribute
DDR_CASN.Mode=DDR3
DDR_CASN.PinAttribute=FirstStageBootLoader
DDR_CASN.Signal=DDR_CASN
DDR_CKE.GPIOParameters=PinAttribute
DDR_CKE.Mode=DDR3
DDR_CKE.PinAttribute=FirstStageBootLoader
DDR_CKE.Signal=DDR_CKE
DDR_CLKN.GPIOParameters=PinAttribute
DDR_CLKN.Mode=DDR3
DDR_CLKN.PinAttribute=FirstStageBootLoader
DDR_CLKN.Signal=DDR_CLKN
DDR_CLKP.GPIOParameters=PinAttribute
DDR_CLKP.Mode=DDR3
DDR_CLKP.PinAttribute=FirstStageBootLoader
DDR_CLKP.Signal=DDR_CLKP
DDR_CSN.GPIOParameters=PinAttribute
DDR_CSN.Mode=DDR3
DDR_CSN.PinAttribute=FirstStageBootLoader
DDR_CSN.Signal=DDR_CSN
DDR_DQ0.GPIOParameters=PinAttribute
DDR_DQ0.Mode=DDR3
DDR_DQ0.PinAttribute=FirstStageBootLoader
DDR_DQ0.Signal=DDR_DQ0
DDR_DQ1.GPIOParameters=PinAttribute
DDR_DQ1.Mode=DDR3
DDR_DQ1.PinAttribute=FirstStageBootLoader
DDR_DQ1.Signal=DDR_DQ1
DDR_DQ10.GPIOParameters=PinAttribute
DDR_DQ10.Mode=DDR3
DDR_DQ10.PinAttribute=FirstStageBootLoader
DDR_DQ10.Signal=DDR_DQ10
DDR_DQ11.GPIOParameters=PinAttribute
DDR_DQ11.Mode=DDR3
DDR_DQ11.PinAttribute=FirstStageBootLoader
DDR_DQ11.Signal=DDR_DQ11
DDR_DQ12.GPIOParameters=PinAttribute
DDR_DQ12.Mode=DDR3
DDR_DQ12.PinAttribute=FirstStageBootLoader
DDR_DQ12.Signal=DDR_DQ12
DDR_DQ13.GPIOParameters=PinAttribute
DDR_DQ13.Mode=DDR3
DDR_DQ13.PinAttribute=FirstStageBootLoader
DDR_DQ13.Signal=DDR_DQ13
DDR_DQ14.GPIOParameters=PinAttribute
DDR_DQ14.Mode=DDR3
DDR_DQ14.PinAttribute=FirstStageBootLoader
DDR_DQ14.Signal=DDR_DQ14
DDR_DQ15.GPIOParameters=PinAttribute
DDR_DQ15.Mode=DDR3
DDR_DQ15.PinAttribute=FirstStageBootLoader
DDR_DQ15.Signal=DDR_DQ15
DDR_DQ2.GPIOParameters=PinAttribute
DDR_DQ2.Mode=DDR3
DDR_DQ2.PinAttribute=FirstStageBootLoader
DDR_DQ2.Signal=DDR_DQ2
DDR_DQ3.GPIOParameters=PinAttribute
DDR_DQ3.Mode=DDR3
DDR_DQ3.PinAttribute=FirstStageBootLoader
DDR_DQ3.Signal=DDR_DQ3
DDR_DQ4.GPIOParameters=PinAttribute
DDR_DQ4.Mode=DDR3
DDR_DQ4.PinAttribute=FirstStageBootLoader
DDR_DQ4.Signal=DDR_DQ4
DDR_DQ5.GPIOParameters=PinAttribute
DDR_DQ5.Mode=DDR3
DDR_DQ5.PinAttribute=FirstStageBootLoader
DDR_DQ5.Signal=DDR_DQ5
DDR_DQ6.GPIOParameters=PinAttribute
DDR_DQ6.Mode=DDR3
DDR_DQ6.PinAttribute=FirstStageBootLoader
DDR_DQ6.Signal=DDR_DQ6
DDR_DQ7.GPIOParameters=PinAttribute
DDR_DQ7.Mode=DDR3
DDR_DQ7.PinAttribute=FirstStageBootLoader
DDR_DQ7.Signal=DDR_DQ7
DDR_DQ8.GPIOParameters=PinAttribute
DDR_DQ8.Mode=DDR3
DDR_DQ8.PinAttribute=FirstStageBootLoader
DDR_DQ8.Signal=DDR_DQ8
DDR_DQ9.GPIOParameters=PinAttribute
DDR_DQ9.Mode=DDR3
DDR_DQ9.PinAttribute=FirstStageBootLoader
DDR_DQ9.Signal=DDR_DQ9
DDR_DQM0.GPIOParameters=PinAttribute
DDR_DQM0.Mode=DDR3
DDR_DQM0.PinAttribute=FirstStageBootLoader
DDR_DQM0.Signal=DDR_DQM0
DDR_DQM1.GPIOParameters=PinAttribute
DDR_DQM1.Mode=DDR3
DDR_DQM1.PinAttribute=FirstStageBootLoader
DDR_DQM1.Signal=DDR_DQM1
DDR_DQS0N.GPIOParameters=PinAttribute
DDR_DQS0N.Mode=DDR3
DDR_DQS0N.PinAttribute=FirstStageBootLoader
DDR_DQS0N.Signal=DDR_DQS0N
DDR_DQS0P.GPIOParameters=PinAttribute
DDR_DQS0P.Mode=DDR3
DDR_DQS0P.PinAttribute=FirstStageBootLoader
DDR_DQS0P.Signal=DDR_DQS0P
DDR_DQS1N.GPIOParameters=PinAttribute
DDR_DQS1N.Mode=DDR3
DDR_DQS1N.PinAttribute=FirstStageBootLoader
DDR_DQS1N.Signal=DDR_DQS1N
DDR_DQS1P.GPIOParameters=PinAttribute
DDR_DQS1P.Mode=DDR3
DDR_DQS1P.PinAttribute=FirstStageBootLoader
DDR_DQS1P.Signal=DDR_DQS1P
DDR_DTO0.GPIOParameters=PinAttribute
DDR_DTO0.Mode=DDR3
DDR_DTO0.PinAttribute=FirstStageBootLoader
DDR_DTO0.Signal=DDR_DTO0
DDR_DTO1.GPIOParameters=PinAttribute
DDR_DTO1.Mode=DDR3
DDR_DTO1.PinAttribute=FirstStageBootLoader
DDR_DTO1.Signal=DDR_DTO1
DDR_ODT.GPIOParameters=PinAttribute
DDR_ODT.Mode=DDR3
DDR_ODT.PinAttribute=FirstStageBootLoader
DDR_ODT.Signal=DDR_ODT
DDR_RASN.GPIOParameters=PinAttribute
DDR_RASN.Mode=DDR3
DDR_RASN.PinAttribute=FirstStageBootLoader
DDR_RASN.Signal=DDR_RASN
DDR_RESETN.GPIOParameters=PinAttribute
DDR_RESETN.Mode=DDR3
DDR_RESETN.PinAttribute=FirstStageBootLoader
DDR_RESETN.Signal=DDR_RESETN
DDR_VREF.GPIOParameters=PinAttribute
DDR_VREF.Mode=DDR3
DDR_VREF.PinAttribute=FirstStageBootLoader
DDR_VREF.Signal=DDR_VREF
DDR_WEN.GPIOParameters=PinAttribute
DDR_WEN.Mode=DDR3
DDR_WEN.PinAttribute=FirstStageBootLoader
DDR_WEN.Signal=DDR_WEN
DDR_ZQ.GPIOParameters=PinAttribute
DDR_ZQ.Mode=DDR3
DDR_ZQ.PinAttribute=FirstStageBootLoader
DDR_ZQ.Signal=DDR_ZQ
ETH1.IPParameters=MediaInterface
ETH1.MediaInterface=HAL_ETH_RMII_MODE
File.Version=6
FirstStageBootLoader.IPs=DDR,RCC,GPIO,DMA,MDMA,NVIC1\:I
GPIO.groupedBy=Group By Peripherals
I2C1.IPParameters=Timing
I2C1.Timing=0x00506682
I2C2.IPParameters=Timing
I2C2.Timing=0x00506682
I2C3.IPParameters=Timing
I2C3.Timing=0x00506682
I2C4.IPParameters=Timing
I2C4.Timing=0x00506682
I2C5.IPParameters=Timing
I2C5.Timing=0x00506682
KeepUserPlacement=false
Mcu.CPN=STM32MP135FAE7
Mcu.Context0=FirstStageBootLoader
Mcu.Context1=Application
Mcu.ContextNb=2
Mcu.ContextProject=Bare Metal Enabled
Mcu.Family=STM32MP1
Mcu.IP0=ADC1
Mcu.IP1=DDR
Mcu.IP10=I2C5
Mcu.IP11=LTDC
Mcu.IP12=QUADSPI
Mcu.IP13=RCC
Mcu.IP14=SDMMC1
Mcu.IP15=SPI1
Mcu.IP16=SPI2
Mcu.IP17=SPI4
Mcu.IP18=SPI5
Mcu.IP19=SYS
Mcu.IP2=ETH1
Mcu.IP20=TIM1
Mcu.IP21=TIM2
Mcu.IP22=UART4
Mcu.IP23=UART5
Mcu.IP24=UART7
Mcu.IP25=UART8
Mcu.IP26=USART1
Mcu.IP27=USART2
Mcu.IP28=USART3
Mcu.IP29=USART6
Mcu.IP3=FMC
Mcu.IP4=NVIC1
Mcu.IP5=NVIC2
Mcu.IP6=I2C1
Mcu.IP7=I2C2
Mcu.IP8=I2C3
Mcu.IP9=I2C4
Mcu.IPNb=30
Mcu.Name=STM32MP135FAEx
Mcu.Package=LFBGA289
Mcu.Pin0=PA9
Mcu.Pin1=PD10
Mcu.Pin10=PB9
Mcu.Pin100=DDR_ODT
Mcu.Pin101=DDR_CSN
Mcu.Pin102=DDR_RASN
Mcu.Pin103=PD13
Mcu.Pin104=PI2
Mcu.Pin105=DDR_A10
Mcu.Pin106=DDR_CASN
Mcu.Pin107=DDR_CLKP
Mcu.Pin108=DDR_CLKN
Mcu.Pin109=PC14-OSC32_IN
Mcu.Pin11=PB14
Mcu.Pin110=PC15-OSC32_OUT
Mcu.Pin111=PC13
Mcu.Pin112=PI1
Mcu.Pin113=DDR_A11
Mcu.Pin114=DDR_CKE
Mcu.Pin115=DDR_A1
Mcu.Pin116=DDR_A12
Mcu.Pin117=PE2
Mcu.Pin118=PF4
Mcu.Pin119=PH6
Mcu.Pin12=PG6
Mcu.Pin120=PI0
Mcu.Pin121=PG3
Mcu.Pin122=DDR_ATO
Mcu.Pin123=DDR_DTO0
Mcu.Pin124=DDR_A8
Mcu.Pin125=DDR_BA1
Mcu.Pin126=DDR_A14
Mcu.Pin127=PF7
Mcu.Pin128=PA8
Mcu.Pin129=PG11
Mcu.Pin13=PD2
Mcu.Pin130=DDR_VREF
Mcu.Pin131=DDR_A4
Mcu.Pin132=DDR_DTO1
Mcu.Pin133=DDR_A6
Mcu.Pin134=PE6
Mcu.Pin135=PG1
Mcu.Pin136=PD7
Mcu.Pin137=PB11
Mcu.Pin138=PF13
Mcu.Pin139=PA3
Mcu.Pin14=PC9
Mcu.Pin140=DDR_DQM1
Mcu.Pin141=DDR_DQ10
Mcu.Pin142=DDR_DQ8
Mcu.Pin143=DDR_ZQ
Mcu.Pin144=PH0-OSC_IN
Mcu.Pin145=PH1-OSC_OUT
Mcu.Pin146=PA13
Mcu.Pin147=PF14
Mcu.Pin148=PA2
Mcu.Pin149=PG13
Mcu.Pin15=PD3
Mcu.Pin150=PG14
Mcu.Pin151=PI5-BOOT1
Mcu.Pin152=DDR_DQ11
Mcu.Pin153=DDR_DQ13
Mcu.Pin154=DDR_DQ9
Mcu.Pin155=PG2
Mcu.Pin156=PH3
Mcu.Pin157=PWR_CPU_ON
Mcu.Pin158=PA1
Mcu.Pin159=PC5
Mcu.Pin16=PF5
Mcu.Pin160=PF15
Mcu.Pin161=PI6-BOOT2
Mcu.Pin162=PH5
Mcu.Pin163=DDR_DQ12
Mcu.Pin164=DDR_DQS1N
Mcu.Pin165=DDR_DQS1P
Mcu.Pin166=PG12
Mcu.Pin167=PA11
Mcu.Pin168=PC0
Mcu.Pin169=PF12
Mcu.Pin17=PD14
Mcu.Pin170=PC3
Mcu.Pin171=PF11
Mcu.Pin172=PB1
Mcu.Pin173=PA6
Mcu.Pin174=PE5
Mcu.Pin175=PA14
Mcu.Pin176=PH4
Mcu.Pin177=DDR_DQ15
Mcu.Pin178=DDR_DQ14
Mcu.Pin179=PA7
Mcu.Pin18=PE12
Mcu.Pin180=PA0
Mcu.Pin181=PA5
Mcu.Pin182=PA4
Mcu.Pin183=PC4
Mcu.Pin184=PB0
Mcu.Pin185=PC1
Mcu.Pin186=PC2
Mcu.Pin187=PI4-BOOT0
Mcu.Pin188=PA10
Mcu.Pin189=PI7
Mcu.Pin19=PE1
Mcu.Pin190=VP_DDR_DDR3
Mcu.Pin191=VP_DDR_DDR_16_bits
Mcu.Pin192=VP_DDR_DDR3_16_4Gb
Mcu.Pin193=VP_SYS_VS_Systick
Mcu.Pin194=VP_TIM2_VS_ClockSourceINT
Mcu.Pin195=VP_DMA_VS_DMA1_Application
Mcu.Pin196=VP_DMA_VS_DMA2_Application
Mcu.Pin197=VP_DMA_VS_DMA3_Application
Mcu.Pin198=VP_MDMA_VS_MDMA_A7NS_8
Mcu.Pin2=PB7
Mcu.Pin20=PE9
Mcu.Pin21=PH14
Mcu.Pin22=PE10
Mcu.Pin23=PF1
Mcu.Pin24=PF3
Mcu.Pin25=PC6
Mcu.Pin26=PB15
Mcu.Pin27=PB4
Mcu.Pin28=PC10
Mcu.Pin29=PC12
Mcu.Pin3=PE7
Mcu.Pin30=DDR_DQ4
Mcu.Pin31=DDR_DQ0
Mcu.Pin32=PB6
Mcu.Pin33=PH12
Mcu.Pin34=PE14
Mcu.Pin35=PE13
Mcu.Pin36=PD8
Mcu.Pin37=PD12
Mcu.Pin38=PD15
Mcu.Pin39=PG7
Mcu.Pin4=PD5
Mcu.Pin40=PB5
Mcu.Pin41=PB3
Mcu.Pin42=PF0
Mcu.Pin43=PC11
Mcu.Pin44=DDR_DQ1
Mcu.Pin45=DDR_DQS0N
Mcu.Pin46=DDR_DQS0P
Mcu.Pin47=PB8
Mcu.Pin48=PD6
Mcu.Pin49=PE11
Mcu.Pin5=PE8
Mcu.Pin50=PD1
Mcu.Pin51=PE0
Mcu.Pin52=PG0
Mcu.Pin53=PE15
Mcu.Pin54=PB12
Mcu.Pin55=PB10
Mcu.Pin56=PE3
Mcu.Pin57=PC8
Mcu.Pin58=DDR_DQM0
Mcu.Pin59=DDR_DQ5
Mcu.Pin6=PG4
Mcu.Pin60=DDR_DQ3
Mcu.Pin61=PG9
Mcu.Pin62=PD11
Mcu.Pin63=PA12
Mcu.Pin64=PD0
Mcu.Pin65=PA15
Mcu.Pin66=PD4
Mcu.Pin67=PD9
Mcu.Pin68=PF2
Mcu.Pin69=PB13
Mcu.Pin7=PH9
Mcu.Pin70=PH10
Mcu.Pin71=DDR_DQ2
Mcu.Pin72=DDR_DQ6
Mcu.Pin73=DDR_DQ7
Mcu.Pin74=DDR_A5
Mcu.Pin75=DDR_RESETN
Mcu.Pin76=PG10
Mcu.Pin77=PG5
Mcu.Pin78=PG8
Mcu.Pin79=PH2
Mcu.Pin8=PH13
Mcu.Pin80=PH8
Mcu.Pin81=DDR_A13
Mcu.Pin82=DDR_A9
Mcu.Pin83=DDR_A2
Mcu.Pin84=PF9
Mcu.Pin85=PF6
Mcu.Pin86=PF10
Mcu.Pin87=PG15
Mcu.Pin88=PF8
Mcu.Pin89=DDR_BA2
Mcu.Pin9=PC7
Mcu.Pin90=DDR_A7
Mcu.Pin91=DDR_A3
Mcu.Pin92=DDR_A0
Mcu.Pin93=DDR_BA0
Mcu.Pin94=PH11
Mcu.Pin95=PI3
Mcu.Pin96=PH7
Mcu.Pin97=PB2
Mcu.Pin98=PE4
Mcu.Pin99=DDR_WEN
Mcu.PinsNb=199
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP135FAEx
MxCube.Version=6.13.0
MxDb.Version=DB.6.0.130
NVIC1.ForceEnableDMAVector=true
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.RCC_WAKEUP_IRQn=false\:0\:0\:false\:false\:true\:false\:true\:true
NVIC1.SGI0_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI10_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI11_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI12_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI13_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI14_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI15_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI1_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI2_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI3_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI4_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI5_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI6_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI7_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI8_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SGI9_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.SGI0_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI10_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI11_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI12_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI13_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI14_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI15_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI1_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI2_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI3_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI4_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI5_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI6_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI7_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI8_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SGI9_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
PA0.GPIOParameters=PinAttribute
PA0.PinAttribute=Application
PA0.Signal=S_TIM2_CH1_ETR
PA1.GPIOParameters=GPIO_Label,PinAttribute
PA1.GPIO_Label=uSD_DETECT
PA1.Locked=true
PA1.PinAttribute=Free
PA1.Signal=GPIO_Input
PA10.GPIOParameters=GPIO_Label,PinAttribute
PA10.GPIO_Label=GPIO3
PA10.Locked=true
PA10.PinAttribute=Free
PA10.Signal=GPIO_Output
PA11.GPIOParameters=PinAttribute
PA11.Mode=ETH Clock Output (PHY without Quartz)
PA11.PinAttribute=Application
PA11.Signal=ETH1_CLK
PA12.GPIOParameters=PinAttribute
PA12.Mode=RGB565
PA12.PinAttribute=Application
PA12.Signal=LTDC_G6
PA13.GPIOParameters=GPIO_Label,PinAttribute
PA13.GPIO_Label=LED_RED
PA13.Locked=true
PA13.PinAttribute=Free
PA13.Signal=GPIO_Output
PA14.GPIOParameters=GPIO_Label,PinAttribute
