js216/stm32mp135_test_board/cubemx/sr835-mb.ioc
PA14.GPIO_Label=GPIO4
PA14.Locked=true
PA14.PinAttribute=Free
PA14.Signal=GPIO_Output
PA15.GPIOParameters=PinAttribute
PA15.Mode=RGB565
PA15.PinAttribute=Application
PA15.Signal=LTDC_G7
PA2.GPIOParameters=PinAttribute
PA2.Mode=IN1-Single-Ended
PA2.PinAttribute=Application
PA2.Signal=ADC1_INP1
PA3.GPIOParameters=PinAttribute
PA3.Mode=Full_Duplex_Master
PA3.PinAttribute=Application
PA3.Signal=SPI1_MOSI
PA4.GPIOParameters=GPIO_Label,PinAttribute
PA4.GPIO_Label=GPIO0
PA4.Locked=true
PA4.PinAttribute=Free
PA4.Signal=GPIO_Output
PA5.GPIOParameters=GPIO_Label,PinAttribute
PA5.GPIO_Label=GPIO1
PA5.Locked=true
PA5.PinAttribute=Free
PA5.Signal=GPIO_Output
PA6.GPIOParameters=GPIO_Label,PinAttribute
PA6.GPIO_Label=GPIO2
PA6.Locked=true
PA6.PinAttribute=Free
PA6.Signal=GPIO_Output
PA7.GPIOParameters=PinAttribute
PA7.Mode=RMII (Reduced MII)
PA7.PinAttribute=Application
PA7.Signal=ETH1_CRS_DV
PA8.GPIOParameters=PinAttribute
PA8.Mode=I2C
PA8.PinAttribute=Application
PA8.Signal=I2C4_SDA
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.PinAttribute=Application
PA9.Signal=FMC_NWAIT
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=GPIO5
PB0.Locked=true
PB0.PinAttribute=Free
PB0.Signal=GPIO_Output
PB1.GPIOParameters=PinAttribute
PB1.Mode=Full_Duplex_Master
PB1.PinAttribute=Application
PB1.Signal=SPI1_SCK
PB10.GPIOParameters=PinAttribute
PB10.Mode=Asynchronous
PB10.PinAttribute=Application
PB10.Signal=USART3_TX
PB11.GPIOParameters=PinAttribute
PB11.Mode=RMII (Reduced MII)
PB11.PinAttribute=Application
PB11.Signal=ETH1_TX_EN
PB12.GPIOParameters=PinAttribute
PB12.Mode=RGB565
PB12.PinAttribute=Application
PB12.Signal=LTDC_R3
PB13.GPIOParameters=PinAttribute
PB13.Mode=NSS_Signal_Hard_Output
PB13.PinAttribute=Application
PB13.Signal=SPI2_NSS
PB14.GPIOParameters=PinAttribute
PB14.Mode=Asynchronous
PB14.PinAttribute=Application
PB14.Signal=USART1_TX
PB15.GPIOParameters=PinAttribute
PB15.Mode=Output Compare3 CH3N
PB15.PinAttribute=Application
PB15.Signal=TIM1_CH3N
PB2.GPIOParameters=PinAttribute
PB2.Mode=RGB565
PB2.PinAttribute=Application
PB2.Signal=LTDC_B4
PB3.GPIOParameters=PinAttribute
PB3.Mode=Asynchronous
PB3.PinAttribute=Application
PB3.Signal=UART7_RX
PB4.GPIOParameters=PinAttribute
PB4.Mode=Full_Duplex_Master
PB4.PinAttribute=Application
PB4.Signal=SPI4_SCK
PB5.GPIOParameters=PinAttribute
PB5.Mode=Asynchronous
PB5.PinAttribute=Application
PB5.Signal=UART5_RX
PB6.GPIOParameters=PinAttribute
PB6.Mode=RGB565
PB6.PinAttribute=Application
PB6.Signal=LTDC_B7
PB7.GPIOParameters=GPIO_Label,PinAttribute
PB7.GPIO_Label=CTP_RST
PB7.Locked=true
PB7.PinAttribute=Free
PB7.Signal=GPIO_Output
PB8.GPIOParameters=PinAttribute
PB8.Mode=I2C
PB8.PinAttribute=Application
PB8.Signal=I2C1_SCL
PB9.GPIOParameters=PinAttribute
PB9.Mode=Asynchronous
PB9.PinAttribute=Application
PB9.Signal=UART5_TX
PC0.GPIOParameters=GPIO_Label,PinAttribute
PC0.GPIO_Label=GPIO6
PC0.Locked=true
PC0.PinAttribute=Free
PC0.Signal=GPIO_Output
PC1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=GPIO7
PC1.Locked=true
PC1.PinAttribute=Free
PC1.Signal=GPIO_Output
PC10.GPIOParameters=PinAttribute
PC10.Mode=SD_4_bits_Wide_bus
PC10.PinAttribute=Application
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=PinAttribute
PC11.Mode=SD_4_bits_Wide_bus
PC11.PinAttribute=Application
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=PinAttribute
PC12.Mode=SD_4_bits_Wide_bus
PC12.PinAttribute=Application
PC12.Signal=SDMMC1_CK
PC13.GPIOParameters=GPIO_Label,PinAttribute
PC13.GPIO_Label=GPIO9
PC13.Locked=true
PC13.PinAttribute=Free
PC13.Signal=GPIO_Output
PC14-OSC32_IN.GPIOParameters=GPIO_Label,PinAttribute
PC14-OSC32_IN.GPIO_Label=GPIO10
PC14-OSC32_IN.Locked=true
PC14-OSC32_IN.PinAttribute=Free
PC14-OSC32_IN.Signal=GPIO_Output
PC15-OSC32_OUT.GPIOParameters=GPIO_Label,PinAttribute
PC15-OSC32_OUT.GPIO_Label=GPIO11
PC15-OSC32_OUT.Locked=true
PC15-OSC32_OUT.PinAttribute=Free
PC15-OSC32_OUT.Signal=GPIO_Output
PC2.GPIOParameters=GPIO_Label,PinAttribute
PC2.GPIO_Label=GPIO8
PC2.Locked=true
PC2.PinAttribute=Free
PC2.Signal=GPIO_Output
PC3.GPIOParameters=PinAttribute
PC3.Mode=Full_Duplex_Master
PC3.PinAttribute=Application
PC3.Signal=SPI1_MISO
PC4.GPIOParameters=PinAttribute
PC4.Mode=RMII (Reduced MII)
PC4.PinAttribute=Application
PC4.Signal=ETH1_RXD0
PC5.GPIOParameters=PinAttribute
PC5.Mode=RMII (Reduced MII)
PC5.PinAttribute=Application
PC5.Signal=ETH1_RXD1
PC6.GPIOParameters=PinAttribute
PC6.Mode=Asynchronous
PC6.PinAttribute=Application
PC6.Signal=USART6_TX
PC7.GPIOParameters=PinAttribute
PC7.Mode=Asynchronous
PC7.PinAttribute=Application
PC7.Signal=USART6_RX
PC8.GPIOParameters=PinAttribute
PC8.Mode=SD_4_bits_Wide_bus
PC8.PinAttribute=Application
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=PinAttribute
PC9.Mode=SD_4_bits_Wide_bus
PC9.PinAttribute=Application
PC9.Signal=SDMMC1_D1
PD0.GPIOParameters=PinAttribute
PD0.PinAttribute=Application
PD0.Signal=FMC_D2_DA2
PD1.GPIOParameters=PinAttribute
PD1.PinAttribute=Application
PD1.Signal=FMC_D3_DA3
PD10.GPIOParameters=PinAttribute
PD10.Mode=NSS_Signal_Hard_Output
PD10.PinAttribute=Application
PD10.Signal=SPI4_NSS
PD11.GPIOParameters=PinAttribute
PD11.PinAttribute=Application
PD11.Signal=FMC_A16_CLE
PD12.GPIOParameters=PinAttribute
PD12.PinAttribute=Application
PD12.Signal=FMC_A17_ALE
PD13.GPIOParameters=PinAttribute
PD13.Mode=Asynchronous
PD13.PinAttribute=Application
PD13.Signal=USART1_RX
PD14.GPIOParameters=PinAttribute
PD14.PinAttribute=Application
PD14.Signal=FMC_D0_DA0
PD15.GPIOParameters=PinAttribute
PD15.PinAttribute=Application
PD15.Signal=FMC_D1_DA1
PD2.GPIOParameters=PinAttribute
PD2.Mode=SD_4_bits_Wide_bus
PD2.PinAttribute=Application
PD2.Signal=SDMMC1_CMD
PD3.GPIOParameters=PinAttribute
PD3.Mode=I2C
PD3.PinAttribute=Application
PD3.Signal=I2C1_SDA
PD4.GPIOParameters=PinAttribute
PD4.PinAttribute=Application
PD4.Signal=FMC_NOE
PD5.GPIOParameters=PinAttribute
PD5.PinAttribute=Application
PD5.Signal=FMC_NWE
PD6.GPIOParameters=PinAttribute
PD6.Mode=Asynchronous
PD6.PinAttribute=Application
PD6.Signal=UART4_TX
PD7.GPIOParameters=PinAttribute
PD7.Mode=Single Bank 1
PD7.PinAttribute=Application
PD7.Signal=QUADSPI_BK1_IO2
PD8.GPIOParameters=PinAttribute
PD8.Locked=true
PD8.Mode=Asynchronous
PD8.PinAttribute=Application
PD8.Signal=UART4_RX
PD9.GPIOParameters=PinAttribute
PD9.Mode=RGB565
PD9.PinAttribute=Application
PD9.Signal=LTDC_CLK
PE0.GPIOParameters=PinAttribute
PE0.Mode=Asynchronous
PE0.PinAttribute=Application
PE0.Signal=UART8_RX
PE1.GPIOParameters=PinAttribute
PE1.Mode=RGB565
PE1.PinAttribute=Application
PE1.Signal=LTDC_HSYNC
PE10.GPIOParameters=PinAttribute
PE10.PinAttribute=Application
PE10.Signal=FMC_D7_DA7
PE11.GPIOParameters=PinAttribute
PE11.Mode=Full_Duplex_Master
PE11.PinAttribute=Application
PE11.Signal=SPI4_MOSI
PE12.GPIOParameters=PinAttribute
PE12.Mode=RGB565
PE12.PinAttribute=Application
PE12.Signal=LTDC_VSYNC
PE13.GPIOParameters=PinAttribute
PE13.Mode=Full_Duplex_Master
PE13.PinAttribute=Application
PE13.Signal=SPI4_MISO
PE14.GPIOParameters=PinAttribute
PE14.Mode=Single Bank 1
PE14.PinAttribute=Application
PE14.Signal=QUADSPI_BK1_NCS
PE15.GPIOParameters=PinAttribute
PE15.Mode=I2C
PE15.PinAttribute=Application
PE15.Signal=I2C4_SCL
PE2.GPIOParameters=PinAttribute
PE2.Mode=Full_Duplex_Master
PE2.PinAttribute=Application
PE2.Signal=SPI5_MOSI
PE3.GPIOParameters=PinAttribute
PE3.Mode=RGB565
PE3.PinAttribute=Application
PE3.Signal=LTDC_R4
PE4.GPIOParameters=PinAttribute
PE4.Mode=Asynchronous
PE4.PinAttribute=Application
PE4.Signal=UART8_TX
PE5.GPIOParameters=GPIO_Label,PinAttribute
PE5.GPIO_Label=GPIO12
PE5.Locked=true
PE5.PinAttribute=Free
PE5.Signal=GPIO_Output
PE6.GPIOParameters=PinAttribute
PE6.Mode=RGB565
PE6.PinAttribute=Application
PE6.Signal=LTDC_G3
PE7.GPIOParameters=PinAttribute
PE7.PinAttribute=Application
PE7.Signal=FMC_D4_DA4
PE8.GPIOParameters=PinAttribute
PE8.PinAttribute=Application
PE8.Signal=FMC_D5_DA5
PE9.GPIOParameters=PinAttribute
PE9.PinAttribute=Application
PE9.Signal=FMC_D6_DA6
PF0.GPIOParameters=PinAttribute
PF0.Mode=RGB565
PF0.PinAttribute=Application
PF0.Signal=LTDC_R6
PF1.GPIOParameters=PinAttribute
PF1.Mode=I2C
PF1.PinAttribute=Application
PF1.Signal=I2C2_SDA
PF10.GPIOParameters=PinAttribute
PF10.Mode=Single Bank 1
PF10.PinAttribute=Application
PF10.Signal=QUADSPI_CLK
PF11.GPIOParameters=GPIO_Label,PinAttribute
PF11.GPIO_Label=GPIO13
PF11.Locked=true
PF11.PinAttribute=Free
PF11.Signal=GPIO_Output
PF12.GPIOParameters=PinAttribute
PF12.Mode=NSS_Signal_Hard_Output
PF12.PinAttribute=Application
PF12.Signal=SPI1_NSS
PF13.GPIOParameters=PinAttribute
PF13.Mode=Asynchronous
PF13.PinAttribute=Application
PF13.Signal=USART2_TX
PF14.Locked=true
PF14.Signal=DEBUG_JTCK-SWCLK
PF15.Locked=true
PF15.Signal=DEBUG_JTMS-SWDIO
PF2.GPIOParameters=PinAttribute
PF2.Mode=I2C
PF2.PinAttribute=Application
PF2.Signal=I2C2_SCL
PF3.GPIOParameters=PinAttribute
PF3.Mode=I2C
PF3.PinAttribute=Application
PF3.Signal=I2C5_SDA
PF4.GPIOParameters=PinAttribute
PF4.Mode=RGB565
PF4.PinAttribute=Application
PF4.Signal=LTDC_B6
PF5.GPIOParameters=PinAttribute
PF5.Mode=RGB565
PF5.PinAttribute=Application
PF5.Signal=LTDC_R5
PF6.GPIOParameters=PinAttribute
PF6.Mode=RGB565
PF6.PinAttribute=Application
PF6.Signal=LTDC_R7
PF7.GPIOParameters=PinAttribute
PF7.Mode=RGB565
PF7.PinAttribute=Application
PF7.Signal=LTDC_G2
PF8.GPIOParameters=PinAttribute
PF8.Mode=Single Bank 1
PF8.PinAttribute=Application
PF8.Signal=QUADSPI_BK1_IO0
PF9.GPIOParameters=PinAttribute
PF9.Mode=Single Bank 1
PF9.PinAttribute=Application
PF9.Signal=QUADSPI_BK1_IO1
PG0.GPIOParameters=PinAttribute
PG0.Mode=RGB565
PG0.PinAttribute=Application
PG0.Signal=LTDC_G5
PG1.GPIOParameters=PinAttribute
PG1.Mode=Full_Duplex_Master
PG1.PinAttribute=Application
PG1.Signal=SPI2_MISO
PG10.GPIOParameters=PinAttribute
PG10.Mode=Full_Duplex_Master
PG10.PinAttribute=Application
PG10.Signal=SPI5_SCK
PG11.GPIOParameters=GPIO_Label,PinAttribute
PG11.GPIO_Label=ETH_NRST
PG11.Locked=true
PG11.PinAttribute=Free
PG11.Signal=GPIO_Output
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.Mode=ETH PHY_INTN
PG12.PinAttribute=Application
PG12.Signal=ETH1_PHY_INTN
PG13.GPIOParameters=PinAttribute
PG13.Mode=RMII (Reduced MII)
PG13.PinAttribute=Application
PG13.Signal=ETH1_TXD0
PG14.GPIOParameters=PinAttribute
PG14.Mode=RMII (Reduced MII)
PG14.PinAttribute=Application
PG14.Signal=ETH1_TXD1
PG15.GPIOParameters=PinAttribute
PG15.Mode=RGB565
PG15.PinAttribute=Application
PG15.Signal=LTDC_B3
PG2.GPIOParameters=PinAttribute
PG2.Mode=RMII (Reduced MII)
PG2.PinAttribute=Application
PG2.Signal=ETH1_MDC
PG3.GPIOParameters=PinAttribute
PG3.Mode=RMII (Reduced MII)
PG3.PinAttribute=Application
PG3.Signal=ETH1_MDIO
PG4.GPIOParameters=PinAttribute
PG4.Mode=Asynchronous
PG4.PinAttribute=Application
PG4.Signal=USART3_RX
PG5.GPIOParameters=PinAttribute
PG5.Mode=RGB565
PG5.PinAttribute=Application
PG5.Signal=LTDC_G4
PG6.GPIOParameters=PinAttribute
PG6.Mode=RGB565
PG6.PinAttribute=Application
PG6.Signal=LTDC_DE
PG7.GPIOParameters=GPIO_Label,PinAttribute
PG7.GPIO_Label=LCD_DISP
PG7.Locked=true
PG7.PinAttribute=Free
PG7.Signal=GPIO_Output
PG8.GPIOParameters=PinAttribute
PG8.Mode=Full_Duplex_Master
PG8.PinAttribute=Application
PG8.Signal=SPI5_MISO
PG9.GPIOParameters=PinAttribute
PG9.Mode=NandChipSelect3_1
PG9.PinAttribute=Application
PG9.Signal=FMC_NCE
PH0-OSC_IN.GPIOParameters=PinAttribute
PH0-OSC_IN.Mode=HSE-External-Oscillator
PH0-OSC_IN.PinAttribute=FirstStageBootLoader,Application
PH0-OSC_IN.Signal=RCC_OSC_IN
PH1-OSC_OUT.GPIOParameters=PinAttribute
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PH1-OSC_OUT.PinAttribute=FirstStageBootLoader,Application
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PH10.GPIOParameters=PinAttribute
PH10.Mode=Full_Duplex_Master
PH10.PinAttribute=Application
PH10.Signal=SPI2_MOSI
PH11.GPIOParameters=PinAttribute
PH11.Mode=NSS_Signal_Hard_Output
PH11.PinAttribute=Application
PH11.Signal=SPI5_NSS
PH12.GPIOParameters=GPIO_Label,PinAttribute
PH12.GPIO_Label=CTP_INT
PH12.Locked=true
PH12.PinAttribute=Free
PH12.Signal=GPIO_Input
PH13.GPIOParameters=PinAttribute
PH13.Mode=I2C
PH13.PinAttribute=Application
PH13.Signal=I2C5_SCL
PH14.GPIOParameters=PinAttribute
PH14.Mode=I2C
PH14.PinAttribute=Application
PH14.Signal=I2C3_SDA
PH2.GPIOParameters=PinAttribute
PH2.Mode=Asynchronous
PH2.PinAttribute=Application
PH2.Signal=UART7_TX
PH3.GPIOParameters=PinAttribute
PH3.Mode=I2C
PH3.PinAttribute=Application
PH3.Signal=I2C3_SCL
PH4.Locked=true
PH4.Signal=DEBUG_JTDI
PH5.Locked=true
PH5.Signal=DEBUG_JTDO-SWO
PH6.GPIOParameters=PinAttribute
PH6.Mode=Full_Duplex_Master
PH6.PinAttribute=Application
PH6.Signal=SPI2_SCK
PH7.GPIOParameters=PinAttribute
PH7.Mode=Single Bank 1
PH7.PinAttribute=Application
PH7.Signal=QUADSPI_BK1_IO3
PH8.GPIOParameters=PinAttribute
PH8.Mode=Asynchronous
PH8.PinAttribute=Application
PH8.Signal=USART2_RX
PH9.GPIOParameters=PinAttribute
PH9.Mode=RGB565
PH9.PinAttribute=Application
PH9.Signal=LTDC_B5
PI0.GPIOParameters=GPIO_Label,PinAttribute
PI0.GPIO_Label=GPIO14
PI0.Locked=true
PI0.PinAttribute=Free
PI0.Signal=GPIO_Output
PI1.GPIOParameters=GPIO_Label,PinAttribute
PI1.GPIO_Label=GPIO15
PI1.Locked=true
PI1.PinAttribute=Free
PI1.Signal=GPIO_Output
PI2.GPIOParameters=GPIO_Label,PinAttribute
PI2.GPIO_Label=GPIO16
PI2.Locked=true
PI2.PinAttribute=Free
PI2.Signal=GPIO_Output
PI3.GPIOParameters=GPIO_Label,PinAttribute
PI3.GPIO_Label=GPIO17
PI3.Locked=true
PI3.PinAttribute=Free
PI3.Signal=GPIO_Output
PI4-BOOT0.GPIOParameters=GPIO_Label,PinAttribute
PI4-BOOT0.GPIO_Label=BOOT0
PI4-BOOT0.Locked=true
PI4-BOOT0.PinAttribute=Free
PI4-BOOT0.Signal=GPIO_Input
PI5-BOOT1.GPIOParameters=GPIO_Label,PinAttribute
PI5-BOOT1.GPIO_Label=BOOT1
PI5-BOOT1.Locked=true
PI5-BOOT1.PinAttribute=Free
PI5-BOOT1.Signal=GPIO_Input
PI6-BOOT2.GPIOParameters=GPIO_Label,PinAttribute
PI6-BOOT2.GPIO_Label=BOOT2
PI6-BOOT2.Locked=true
PI6-BOOT2.PinAttribute=Free
PI6-BOOT2.Signal=GPIO_Input
PI7.GPIOParameters=GPIO_Label,PinAttribute
PI7.GPIO_Label=GPIO18
PI7.Locked=true
PI7.PinAttribute=Free
PI7.Signal=GPIO_Output
PWR_CPU_ON.GPIOParameters=GPIO_Label,PinAttribute
PWR_CPU_ON.GPIO_Label=PWR_CPU_ON
PWR_CPU_ON.Locked=true
PWR_CPU_ON.PinAttribute=Free
PWR_CPU_ON.Signal=GPIO_Output
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32MP135FAEx
ProjectManager.FirmwarePackage=STM32Cube FW_MP13 V1.2.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=APP-0x200,FSBL-0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=sr835-mb.ioc
ProjectManager.ProjectName=sr835-mb
ProjectManager.ProjectStructure=FSBL\:FSBL\:false;APP\:APP\:true;
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=APP-0x400,FSBL-0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false-FirstStageBootLoader,2-MX_GPIO_Init-GPIO-false-HAL-true-FirstStageBootLoader,1-SystemClock_Config-RCC-false-HAL-false-Application,2-MX_GPIO_Init-GPIO-false-HAL-true-Application,3-MX_ETH1_Init-ETH1-false-HAL-true-Application,4-MX_FMC_Init-FMC-false-HAL-true-Application,5-MX_I2C5_Init-I2C5-false-HAL-true-Application,6-MX_LTDC_Init-LTDC-false-HAL-true-Application,7-MX_TIM1_Init-TIM1-false-HAL-true-Application,8-MX_TIM2_Init-TIM2-false-HAL-true-Application,9-MX_ADC1_Init-ADC1-false-HAL-true-Application,10-MX_QUADSPI_Init-QUADSPI-false-HAL-true-Application,11-MX_SPI1_Init-SPI1-false-HAL-true-Application,12-MX_UART4_Init-UART4-false-HAL-true-Application,13-MX_UART7_Init-UART7-false-HAL-true-Application,14-MX_UART8_Init-UART8-false-HAL-true-Application,15-MX_USART1_UART_Init-USART1-false-HAL-true-Application,16-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true-Application,17-MX_USART3_UART_Init-USART3-false-HAL-true-Application,18-MX_USART6_UART_Init-USART6-false-HAL-true-Application,19-MX_I2C1_Init-I2C1-false-HAL-true-Application,20-MX_I2C2_Init-I2C2-false-HAL-true-Application,21-MX_I2C3_Init-I2C3-false-HAL-true-Application,22-MX_I2C4_Init-I2C4-false-HAL-true-Application,23-MX_SPI2_Init-SPI2-false-HAL-true-Application,24-MX_SPI4_Init-SPI4-false-HAL-true-Application,25-MX_SPI5_Init-SPI5-false-HAL-true-Application,26-MX_UART5_Init-UART5-false-HAL-true-Application,27-MX_USART2_UART_Init-USART2-false-HAL-true-Application
RCC.ADC1CLockSelection=RCC_ADC1CLKSOURCE_PER
RCC.ADC1Freq_Value=24000000
RCC.ADC2Freq_Value=200000000
RCC.AHB124Freq_Value=24000000
RCC.APB1Freq_Value=24000000
RCC.APB2Freq_Value=24000000
RCC.APB3Freq_Value=24000000
RCC.APB4DIV=RCC_APB4_DIV2
RCC.APB4Freq_Value=102000000
RCC.APB5DIV=RCC_APB5_DIV4
RCC.APB5DIVClockFreq_Value=51000000
RCC.APB6Freq_Value=24000000
RCC.AXICLKFreq_VALUE=204000000
RCC.AXICLKSource=RCC_AXISSOURCE_PLL2
RCC.AXIDIVFreq_Value=204000000
RCC.CKPERCLKFreq_VALUE=24000000
RCC.CKPERCLKSource=RCC_CKPERCLKSOURCE_HSE
RCC.CSI_VALUE=4000000
RCC.DACCLKFreq_VALUE=32000
RCC.DCMIFreq_Value=204000000
RCC.DDRCFreq_Value=408000000
